Autodesk.Revit.DB.View3D.ShowGridsOnLevels(System.Collections.Generic.ISet{Autodesk.Revit.DB.ElementId})
This method displays the grid lines in this 3D view on the given Levels.
Remarks:
Previously selected Levels for showing grids will be replaced with the new ids.
levelsIds:
Levels ids where grids lines will be displayed.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.View3D.HideGridsOnLevel(Autodesk.Revit.DB.ElementId)
This method hides the grid lines in this 3D view on the given Level.
levelId:
The id of the Level where grids will not be displayed.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.View3D.ShowGridsOnLevel(Autodesk.Revit.DB.ElementId)
This method displays the grid lines in this 3DView on the given Level.
Remarks:
Grids will be displayed only if they intersects Level's plane.
levelId:
The id of the Level where grids should be displayed.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.View3D.GetLevelsThatShowGrids
Returns the list of levels ids where grids are displayed in this 3D view.
Returns:
The list of levels ids where grids are displayed in 3D views.
Since:
2022

Autodesk.Revit.DB.View3D.GetSectionBox
Gets a copy of the section box for this 3D view.
Remarks:
The section box cuts the model in this view by its boundaries.
Returns:
The section box.  Note that the section box can be rotated and transformed and thus you will need to use
Autodesk.Revit.DB.BoundingBoxXYZ.Transform to
interpret the coordinates of the corners or sides of the box in model coordinates.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Returns true if the view is not a view template.

Autodesk.Revit.DB.View3D.SetSectionBox(Autodesk.Revit.DB.BoundingBoxXYZ)
Sets the section box for this 3D view.
boundingBoxXYZ:
The bounding box to use for the section box.  To turn off the section box, set Autodesk.Revit.DB.View3D.IsSectionBoxActive to false.
Individual bound enabled flags in the input box are ignored.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Bounding box cannot be empty.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Returns true if the view is not a view template.

Autodesk.Revit.DB.View3D.SaveOrientationAndLock
Locks the view and saves its orientation
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Returns true if the view is not a view template.
-or-
The orientation of the View3D cannot be saved.
Since:
2013

Autodesk.Revit.DB.View3D.OrientTo(Autodesk.Revit.DB.XYZ)
Reorients the view to align with the forward direction.
Remarks:
This method adjusts the ViewOrientation to align with the input forward direction.
The eye position will be automatically determined based on the shape of the
viewing area and size of the model. The UpDirection will be aligned with the project Z axis.
forwardDirection:
The forward direction.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
forwardDirection has zero length.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
View is locked and cannot be reoriented.
Since:
2015

Autodesk.Revit.DB.View3D.SetOrientation(Autodesk.Revit.DB.ViewOrientation3D)
Sets the temporary orientation of the View3D.  The new orientation is not saved in the document.
newViewOrientation3D:
The new orientation to set.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
View is locked and cannot be reoriented.
Since:
2013

Autodesk.Revit.DB.View3D.CreatePerspective(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Returns a new perspective View3D.
Remarks:
The new View3D will receive a unique view name.  The view will be oriented in the same position as the default 3D view.
document:
The document to which the new View3D will be added.
viewFamilyTypeId:
The id of the ViewFamilyType which will be used by the new View3D.  The type needs to be a ThreeDimensional ViewType.
Returns:
The new perspective View3D.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This View Family Type is not a ThreeDimensional view type.
-or-
3D view creation is not allowed in this family.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2013

Autodesk.Revit.DB.View3D.CreateIsometric(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Returns a new isometric View3D.
Remarks:
The new View3D will receive a unique view name.  The view will be oriented in the same position as the default 3D view.
document:
The document to which the new View3D will be added.
viewFamilyTypeId:
The id of the ViewFamilyType which will be used by the new View3D.  The type needs to be a ThreeDimensional ViewType.
Returns:
The new isometric View3D.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This View Family Type is not a ThreeDimensional view type.
-or-
3D view creation is not allowed in this family.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2013

Autodesk.Revit.DB.View3D.SetRenderingSettings(Autodesk.Revit.DB.RenderingSettings)
Changes the rendering settings for this 3d view.
settings:
The new rendering settings to be applied to this view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.View3D.ProjectGridsOnSectionBox
This option projects all grids from the current 3d view on the bottom face of the section box.
Only grids that are inside or intersects the section box
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Returns true if the view is not a view template.
Since:
2022

Autodesk.Revit.DB.View3D.IsSectionBoxActive
Identifies whether or not the section box is active in this 3D view.
An active section box clips the geometry of the model in the 3D view.  This affects
the appearance of the view, and also will affect information returned from the API.  For example:
Elements outside the active section box will not be returned in the list of elements
obtained from Autodesk::Revit::DB::FilteredElementCollector when
this view is passed when contructing the collector.Elements clipped by the active section box will return clipped geometry
from Autodesk.Revit.DB.Element.Geometry(Autodesk.Revit.DB.Options)
when this view is included in the options.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Returns true if the view is not a view template.

Autodesk.Revit.DB.View3D.IsPerspective
Identifies whether this is a perspective view.
Remarks:
In a perspective view, view direction is variable - it is the direction that connects a particular point on the model with the eye position.
The property Autodesk.Revit.DB.View.ViewDirection becomes less meaningful -
it only describes the general orientation of the camera.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Returns true if the view is not a view template.

Autodesk.Revit.DB.View3D.IsLocked
Indicates if the view is locked.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Returns true if the view is not a view template.
Since:
2013